cf_billing/DataProcessors/энргАбонентыМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргАбонентыМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргФилиалыАбонентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФилиалыАбонентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргАбоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргАбоненты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агентский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Домовладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальноеОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМуниципальноеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВнутрРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГород</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаПрописки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговорАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыАбонентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКвартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНасПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРайонАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУлица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPабонент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЕИРЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/энргАбонентыМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияРеквизитовОбъекта(АбонентСсылка, ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].ЗначенияРеквизитовОбъекта(АбонентСсылка, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	мПолучаемыеСвойства = СтрРазделить(ПолучаемыеСвойства, "," , Ложь);
	ОпределитьФилиал 	= НеобходимоОпределитьВспомогательноеПоле(мПолучаемыеСвойства, "Филиал");
	ОпределитьДоговор 	= НеобходимоОпределитьВспомогательноеПоле(мПолучаемыеСвойства, "Договор");	
	яПолучаемыеСвойства = СтрСоединить(мПолучаемыеСвойства, ",");
	
	Результат = Справочники.энргАбоненты.ЗначенияРеквизитовОбъекта(АбонентСсылка, яПолучаемыеСвойства);
	
	Если ОпределитьФилиал Тогда
		Результат.Вставить("Филиал", Обработки.энргФилиалыСтроенийМенеджер.ФилиалАбонента(АбонентСсылка));
	КонецЕсли;
	
	Если ОпределитьДоговор Тогда
		Результат.Вставить("Договор", ПолучитьДоговорАбонента(Дата(1, 1, 1), АбонентСсылка));
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.ЗначенияРеквизитовОбъекта";
		ПараметрыМетода 			= Новый Структура("АбонентСсылка, ПолучаемыеСвойства", АбонентСсылка, ПолучаемыеСвойства); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьДанныеАбонента(ОбъектФормы) Экспорт 
	
	ДанныеАбонента  				= Новый Структура;
	
	ДанныеАбонента.Вставить("ФизЛицо", "" + Справочники.ФизическиеЛица.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.ФизЛицо) Тогда
		ДанныеАбонента.ФизЛицо 					= "" + ОбъектФормы.ФизЛицо.УникальныйИдентификатор();
	КонецЕсли;
			
	ДанныеАбонента.Вставить("ВидОбъекта", "" + Справочники.энргВидыОбъектовАбонента.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.ВидОбъекта) Тогда
		ДанныеАбонента.ВидОбъекта 				= "" + ОбъектФормы.ВидОбъекта.УникальныйИдентификатор();
	КонецЕсли;
	
	ДанныеАбонента.Вставить("МуниципальноеОбразование", "" + Справочники.энргМуниципальноеОбразование.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.МуниципальноеОбразование) Тогда
		ДанныеАбонента.МуниципальноеОбразование =  "" + ОбъектФормы.МуниципальноеОбразование.УникальныйИдентификатор();
	КонецЕсли;  	
			
	ДанныеАбонента.Вставить("Филиал", "" + Справочники.энргФилиалы.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.Филиал) Тогда
		ДанныеАбонента.Филиал 					= "" + ОбъектФормы.Филиал.УникальныйИдентификатор();
	КонецЕсли;
	
	Запись 										= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись,ДанныеАбонента);
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ЗначенияРеквизитовИзСтрокиJSON(ОписаниеАбонента, ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].ЗначенияРеквизитовИзСтрокиJSON(ОписаниеАбонента, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Чтение  								= Новый ЧтениеJSON;	
	Чтение.УстановитьСтроку(ОписаниеАбонента);
	ДанныеАбонента 							= ПрочитатьJSON(Чтение);
	
	Результат 								= Новый Структура(ПолучаемыеСвойства);
	мПолучаемыеСвойства 					= СтрРазделить(ПолучаемыеСвойства,",",Ложь);
	
	Если ДанныеАбонента.Свойство("ФизЛицо") и НЕ мПолучаемыеСвойства.Найти("Контрагент") = Неопределено Тогда
		Результат["Контрагент"] 			= Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.ФизЛицо));
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("ВидОбъекта") И НЕ мПолучаемыеСвойства.Найти("ВидОбъекта") = Неопределено Тогда
		Результат["ВидОбъекта"] 		 	= Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.ВидОбъекта));
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("Филиал") И НЕ мПолучаемыеСвойства.Найти("Филиал") = Неопределено Тогда
		Результат["Филиал"]  				= Справочники.энргФилиалы.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.Филиал));
	КонецЕсли;	
	
	Если ДанныеАбонента.Свойство("МуниципальноеОбразование") И НЕ мПолучаемыеСвойства.Найти("МуниципальноеОбразование") = Неопределено Тогда
		Результат["МуниципальноеОбразование"] = Справочники.энргМуниципальноеОбразование.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.МуниципальноеОбразование)); 
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.ЗначенияРеквизитовИзСтрокиJSON";
		ПараметрыМетода 			= Новый Структура("ОписаниеАбонента, ПолучаемыеСвойства",ОписаниеАбонента, ПолучаемыеСвойства); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция МассивСсылокПолноТекствогоПоиска(СтрокаПоиска) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].МассивСсылокПолноТекствогоПоиска(СтрокаПоиска);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат  						= Справочники.энргАбоненты.МассивСсылокПолноТекствогоПоиска(СтрокаПоиска);
		
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.МассивСсылокПолноТекствогоПоиска";
		ПараметрыМетода 			= Новый Структура("ОписаниеАбонента",СтрокаПоиска); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПоКлючевымПараметрам(ДатаДокумента,Организация,Район,КлючПомещения,ФизЛицо,Поставщик,Услуги) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].СсылкаПоКлючевымПараметрам(ДатаДокумента,Организация,Район,КлючПомещения,ФизЛицо,Поставщик,Услуги);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Результат 						= Справочники.энргАбоненты.СсылкаПоКлючевымПараметрам(ДатаДокумента,Организация,Район,КлючПомещения,ФизЛицо,Поставщик,Услуги);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.СсылкаПоКлючевымПараметрам";
		ПараметрыМетода 			= Новый Структура("Организация,Район,КлючПомещения,ФизЛицо",Организация,Район,КлючПомещения,ФизЛицо); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПоЛицевомуСчету(ЛицевойСчет) Экспорт 
	Результат = Справочники.энргАбоненты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.Ссылка КАК Абонент
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	энргАбоненты.ЛицевойСчет = &ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.Абонент;
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьОбъектПоОписанию(ОписаниеОбъекта, ЭтоНоваяСсылка, Период) Экспорт 
	перем ЛицевойСчет;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	 	
	Организация 					= ОписаниеОбъекта.Организация;
	Район 							= ОписаниеОбъекта.Район;
	КлючПомещения					= ОписаниеОбъекта.КлючПомещения;
	ФизЛицо 						= ОписаниеОбъекта.ФизЛицо;
	ГруппаАбонента 					= ОписаниеОбъекта.ГруппаАбонента;	
	АбонентСсылка 					= ОписаниеОбъекта.Ссылка;
	Филиал 							= ОписаниеОбъекта.Филиал;
	
	Если ЭтоНоваяСсылка Тогда
		ЛицевойСчет 				= Обработки.энргНомераЛицевыхСчетовМенеджер.СФормироватьЛицевойСчет(Организация,Район,ГруппаАбонента, Филиал);
	КонецЕсли;	
	
	Справочники.энргАбоненты.ЗаполнитьОбъектПоОписанию(АбонентСсылка, ОписаниеОбъекта, ЛицевойСчет, ЭтоНоваяСсылка);
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		МЗ 							= РегистрыСведений.энргФилиалыАбонентов.СоздатьМенеджерЗаписи();
		МЗ.Абонент					= АбонентСсылка;
		МЗ.Период					= Период;
		МЗ.Филиал					= Филиал;
		МЗ.Записать(Истина);
		// ЗаполнитьЗначенияСвойств(АбонентОбъект,ДанныеАбонента,"Филиал");
	КонецЕсли;

	
КонецПроцедуры

Функция ПолучитьДоговорАбонента(Период, Абонент) Экспорт
	
	Результат = Обработки.энргДоговорыКонтрагентовМенеджер.ПолучитьДоговорАбонента(Период, Абонент);
	Возврат Результат;
	
КонецФункции

Функция РезультатЗапросаСостоянияЛС(Период, Организация, Район, Абонент) Экспорт
	
	СхемаЗапроса	= Неопределено;
	ПараметрыОтбора	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация", "Организация"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район", "Район"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Абонент", "Абонент"))); 
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	КонецЕсли;
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(СхемаЗапроса, ПараметрыОтбора);	 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"	, Период);
	ПараметрыЗапроса.Вставить("Организация"	, Организация);		
	ПараметрыЗапроса.Вставить("Район"	, Район);		
	ПараметрыЗапроса.Вставить("Абонент"	, Абонент);		
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПараметрыЗапроса);
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ОписаниеОбъекта() Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", 					Справочники.энргАбоненты.ПустаяСсылка());
	Результат.Вставить("Организация", 				Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Район", 					Справочники.энргЗоныОтвественности.ПустаяСсылка());
	Результат.Вставить("КлючПомещения", 			Справочники.энргКлючиПомещений.ПустаяСсылка());
	Результат.Вставить("ФизЛицо", 					Справочники.ФизическиеЛица.ПустаяСсылка());
	Результат.Вставить("ГруппаАбонента", 			Справочники.энргАбоненты.ПустаяСсылка());
	Результат.Вставить("ВидОбъекта", 				Справочники.энргВидыОбъектовАбонента.ПустаяСсылка());
	Результат.Вставить("СтарыйЛС",					"");
	Результат.Вставить("Филиал",					Справочники.энргФилиалы.ПустаяСсылка());
	Результат.Вставить("МуниципальноеОбразование",	Справочники.энргМуниципальноеОбразование.ПустаяСсылка());
	Результат.Вставить("Поставщик",					Справочники.энргКонтрагенты.ПустаяСсылка());
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НеобходимоОпределитьВспомогательноеПоле(мПолучаемыеСвойства, ИмяСвойства)
	
	Результат = Ложь;
	ИндексСвойстваФилиал = мПолучаемыеСвойства.Найти(ИмяСвойства);
	
	Если НЕ ИндексСвойстваФилиал = Неопределено Тогда
		мПолучаемыеСвойства.Удалить(ИндексСвойстваФилиал);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
